# 09 Mengenal Categorical Encoding: Label Encoding & One Hot Encoding

## **Apa itu Categorical Encoding?**
Categorical Encoding adalah proses mengubah nilai kategorikal (teks/kategori) menjadi nilai numerik agar dapat digunakan oleh algoritma machine learning.

Terdapat berbagai jenis teknik categorical encoding. Dua yang paling umum digunakan adalah

- **Label Eodi**
- **One Hot oding**  
  Referensi: [One-hot encoding - Wikipedia](https://en.wikipedia.org/wiki/ot)

---

## **Label Encoding**
Label Encoding adalah metode encoding di mana setiap kategori dalam sebuah fitur dikonversi menjadi angka integer berdasarkan urutan tertentu (biasanya ururna` memiliki nilai:
ai integer

In [1]:
import pandas as pd

df = pd.DataFrame({
    'country': ['India', 'US', 'Japan', 'US', 'Japan'],
    'age': [44, 34, 46, 35, 23],
    'salary': [72000, 65000, 98000, 45000, 34000]
})

df

  country  age  salary
0   India   44   72000
1      US   34   65000
2   Japan   46   98000
3      US   35   45000
4   Japan   23   34000

In [2]:
from sklearn.preprocessing import LabelEncoder

label_encoder = LabelEncoder()
df['country'] = label_encoder.fit_transform(df['country'])
df

   country  age  salary
0        0   44   72000
1        2   34   65000
2        1   46   98000
3        2   35   45000
4        1   23   34000

In [3]:
label_encoder.classes_

array(['India', 'Japan', 'US'], dtype=object)

In [4]:
df = pd.DataFrame({
    'country': ['India', 'US', 'Japan', 'US', 'Japan'],
    'age': [44, 34, 46, 35, 23],
    'salary': [72000, 65000, 98000, 45000, 34000]
})

df

  country  age  salary
0   India   44   72000
1      US   34   65000
2   Japan   46   98000
3      US   35   45000
4   Japan   23   34000

In [5]:
X = df['country'].values.reshape(-1,1)
X

array([['India'],
       ['US'],
       ['Japan'],
       ['US'],
       ['Japan']], dtype=object)

In [6]:
from sklearn.preprocessing import OneHotEncoder

onehot_encoder = OneHotEncoder()
X = onehot_encoder.fit_transform(X).toarray()
X

array([[1., 0., 0.],
       [0., 0., 1.],
       [0., 1., 0.],
       [0., 0., 1.],
       [0., 1., 0.]])

In [7]:
onehot_encoder.categories_

[array(['India', 'Japan', 'US'], dtype=object)]

In [8]:
df = pd.concat([df_onehot, df], axis=1)
df

NameError: name 'df_onehot' is not defined

In [ ]:
df = df.drop(['country'], axis=1)
df

**Label Encoding vs One Hot Encoding**

Menerapkan One Hot Encoding bila:

- Nilai categorical adalah nominal
- Jumlah kategori yang ada tidak terlalu banyak

Menerapkan Label Encoding bila:

- Nilai categorical adalah ordinal
- Jumlah kategori yang ada relatif banyak